content/src/first-post.org
#+title: My First Post
#+date: 2023-03-25

* What is this?

So, after nearly a year, and a LOT of $LIFE stuff, here's my next best attempt at blogging.

I have no idea what I intend to write here as of now, but I'll just go with the flow.

* Why is this?

Because I can.

* Who am I?
I'll try to make an 'about' page sometime soon.

* What technology stack is being used?
- Emacs : To write stuff down
- orgmode : As markup of choice
- ox-zola : To convert =.org= files into =.md= compatible with Zola
- Zola : Static site generator that converts =.md= to =.html=, among other stuff (like feed and index generation)
- Github pages : To actually get this on the internet. Because I still haven't setup Cloudflare tunnel on my Pi (Big surprise there, not)
