content/first-post.md
+++
title = "My First Post"
author = ["Payas Relekar"]
date = 2023-03-25
draft = false
[taxonomies]
+++

## What is this? {#what-is-this}

So, after nearly a year, and a LOT of $LIFE stuff, here's my next best attempt at blogging.

I have no idea what I intend to write here as of now, but I'll just go with the flow.


## Why is this? {#why-is-this}

Because I can.


## Who am I? {#who-am-i}

I'll try to make an 'about' page sometime soon.


## What technology stack is being used? {#what-technology-stack-is-being-used}

-   Emacs : To write stuff down
-   orgmode : As markup of choice
-   ox-zola : To convert `.org` files into `.md` compatible with Zola
-   Zola : Static site generator that converts `.md` to `.html`, among other stuff (like feed and index generation)
-   Github pages : To actually get this on the internet. Because I still haven't setup Cloudflare tunnel on my Pi (Big surprise there, not)
